{
    "Home": "Ana Sayfa",
    "About": "Hakkında",
    "Experience": "Deneyim",
    "Projects": "Projeler",
    "Contact": "İletişim",
    "Download CV": "CV İndir",
    "Open to Work": "Çalışmaya Açık",
    "Software Developer & Digital Experience Architect": "Yazılım Geliştirici & Dijital Deneyimler Mimarı",
    "I transform complex problems into scalable and elegant code structures. Designing the future with modern web technologies.": "Karmaşık problemleri ölçeklenebilir ve zarif kod yapılarına dönüştürüyorum. Modern web teknolojileri ile geleceği tasarlıyorum.",
    "View My Projects": "Projelerimi İncele",
    "Get In Touch": "İletişime Geç",
    "About Me": "Hakkımda",
    "A Vision Beyond Code": "Kodun Ötesinde Bir Vizyon",
    "Hello, I'm Hurşit. I'm a software developer with a passion for creative coding and problem solving. Based in Istanbul, I currently design both complex backend systems and fluid user experiences. I see technology not just as a tool, but as an art form that makes human life easier.": "Merhaba, ben Hurşit. Yaratıcı kodlama ve problem çözme tutkusu olan bir yazılım geliştiricisiyim. İstanbul merkezli olarak, şu anda hem karmaşık arka uç sistemleri hem de akıcı kullanıcı deneyimleri tasarlıyorum. Teknolojiyi sadece bir araç olarak değil, insan hayatını kolaylaştıran bir sanat formu olarak görüyorum.",
    "Istanbul, Turkey": "İstanbul, Türkiye",
    "Journey": "Yolculuk",
    "Software Developer": "Yazılım Geliştirici",
    "Present": "Günümüz",
    "Remote": "Uzaktan",
    "Developing scalable web applications for global clients. Building custom CRM solutions and e-commerce infrastructures using Laravel and Vue.js ecosystems.": "Global müşteriler için ölçeklenebilir web uygulamaları geliştiriyorum. Laravel ve Vue.js ekosistemlerini kullanarak özel CRM çözümleri ve e-ticaret altyapıları inşa ediyorum.",
    "Participated in various research projects within the university during Computer Engineering education. Contributed as an intern developer in student information systems and campus automation projects.": "Bilgisayar Mühendisliği eğitimi süresince üniversite bünyesinde çeşitli araştırma projelerinde yer aldım. Öğrenci bilgi sistemleri ve kampüs otomasyon projelerinde stajyer yazılımcı olarak katkı sağladım.",
    "Tech Stack": "Teknoloji Yığını",
    "Skills & Tools": "Beceriler & Araçlar",
    "DevOps & Tools": "DevOps & Araçlar",
    "Portfolio": "Portfolyo",
    "Recent Works": "Son Çalışmalar",
    "View All Projects": "Tüm Projeleri Gör",
    "Corporate": "Kurumsal",
    "Modern and fast promotional website reflecting corporate identity. Easy content management with custom CMS panel.": "Kurumsal kimliği yansıtan, modern ve hızlı bir tanıtım sitesi. Özel CMS paneli ile kolay içerik yönetimi.",
    "Health": "Sağlık",
    "Platform": "Platform",
    "Patient tracking and appointment management system for a healthcare organization based in the Netherlands. KVKK/GDPR compliant secure infrastructure.": "Hollanda merkezli sağlık kuruluşu için hasta takip ve randevu yönetim sistemi. KVKK/GDPR uyumlu güvenli altyapı.",
    "Education": "Eğitim",
    "Comprehensive school management system and distance education module integrating students, parents, and teachers.": "Öğrenci, veli ve öğretmenlerin entegre olduğu kapsamlı bir okul yönetim sistemi ve uzaktan eğitim modülü.",
    "Let's Create Something Great": "Harika Bir Şeyler Yaratalım",
    "Have a project in mind or just want to say hi? Feel free to reach out.": "Aklınızda bir proje mi var ya da sadece merhaba demek mi istiyorsunuz? Çekinmeden iletişime geçin.",
    "All rights reserved.": "Tüm hakları saklıdır.",
    "Designed & Coded with passion.": "Tutkuyla tasarlandı ve kodlandı.",
    "Available for freelance work": "Freelance çalışmaya uygun",
    "Architecting the": "Mimari",
    "Future of Web.": "Web'in Geleceği.",
    "I'm a Full Stack Developer specializing in building exceptional digital experiences. Currently focused on human-centered products that blend aesthetics with performance.": "Ben, olağanüstü dijital deneyimler oluşturma konusunda uzmanlaşmış bir Full Stack Geliştiricisiyim. Şu anda estetiği performansla harmanlayan insan odaklı ürünlere odaklanıyorum.",
    "View My Work": "Çalışmalarımı Gör",
    "Selected Works": "Seçilmiş Çalışmalar",
    "A curation of my best engineering.": "En iyi mühendislik çalışmalarımın bir derlemesi.",
    "All Projects": "Tüm Projeler",
    "Fintech": "Fintech",
    "A comprehensive financial analytics platform featuring real-time websocket data, interactive D3.js visualizations, and dark mode support.": "Gerçek zamanlı websocket verileri, etkileşimli D3.js görselleştirmeleri ve karanlık mod desteği içeren kapsamlı bir finansal analiz platformu.",
    "Mobile": "Mobil",
    "Mindfulness and meditation tracking app built with React Native.": "React Native ile oluşturulmuş farkındalık ve meditasyon takip uygulaması.",
    "SaaS": "SaaS",
    "Developer productivity suite for team collaboration.": "Takım işbirliği için geliştirici verimlilik paketi.",
    "E-commerce": "E-ticaret",
    "High-end fashion marketplace with headless Shopify integration, AI-powered recommendations, and 3D product previews.": "Headless Shopify entegrasyonu, yapay zeka destekli öneriler ve 3D ürün önizlemeleri içeren üst düzey moda pazaryeri.",
    "Let's Talk": "Konuşalım",
    "Ready to start a project?": "Bir projeye başlamaya hazır mısınız?",
    "I'm currently available for freelance projects and open to full-time opportunities. If you have a project that needs some creative touch, let's chat.": "Şu anda freelance projeler için uygunum ve tam zamanlı fırsatlara açığım. Yaratıcı bir dokunuşa ihtiyacı olan bir projeniz varsa, konuşalım.",
    "Say Hello": "Merhaba De",
    "Available for hire": "Kiralanabilir",
    "Insights &": "İçgörüler &",
    "Digital Artistry": "Dijital Sanat",
    "Exploring the intersection of scalable systems and creative frontend engineering. A deep dive into Rust, React, and system design.": "Ölçeklenebilir sistemlerin ve yaratıcı ön uç mühendisliğinin kesişimini keşfetmek. Rust, React ve sistem tasarımına derinlemesine bir bakış.",
    "Search articles...": "Makaleleri ara...",
    "Enter": "Giriş",
    "Latest Drop": "Son Yayın",
    "The Architecture of minimalistic UIs": "Minimalist Arayüzlerin Mimarisi",
    "All": "Tümü",
    "Featured Story": "Öne Çıkan Hikaye",
    "Architecture": "Mimari",
    "12 min read": "12 dk okuma",
    "Building Scalable Systems with Rust": "Rust ile Ölçeklenebilir Sistemler Oluşturma",
    "Memory safety without garbage collection is a game changer. Here's an in-depth look at how we migrated our core services to Rust, achieving 300% performance gains while eliminating data races entirely.": "Çöp toplama olmadan bellek güvenliği oyunun kurallarını değiştiriyor. Çekirdek hizmetlerimizi Rust'a nasıl taşıdığımıza, veri yarışlarını tamamen ortadan kaldırırken %300 performans kazanımını nasıl elde ettiğimize derinlemesine bir bakış.",
    "Read Article": "Makaleyi Oku",
    "Latest Writings": "Son Yazılar",
    "View Archive": "Arşivi Görüntüle",
    "Design": "Tasarım",
    "Mastering CSS Grid in 2024": "2024'te CSS Grid'de Uzmanlaşmak",
    "A comprehensive guide to modern layouts using Grid and Subgrid features effectively.": "Grid ve Subgrid özelliklerini etkili bir şekilde kullanarak modern düzenlere yönelik kapsamlı bir rehber.",
    "Oct 24, 2023": "24 Eki 2023",
    "5 min read": "5 dk okuma",
    "Why I switched to Linux for Development": "Geliştirme İçin Neden Linux'a Geçtim",
    "Leaving macOS behind wasn't easy, but the control and customization were worth it.": "macOS'u geride bırakmak kolay değildi ama kontrol ve özelleştirme buna değdi.",
    "Nov 02, 2023": "02 Kas 2023",
    "8 min read": "8 dk okuma",
    "The Future of AI in Web Dev": "Web Geliştirmede Yapay Zekanın Geleceği",
    "Will LLMs replace frontend engineers? Or will they just make us 10x faster?": "LLM'ler ön uç mühendislerinin yerini alacak mı? Yoksa bizi sadece 10 kat daha hızlı mı yapacaklar?",
    "Nov 15, 2023": "15 Kas 2023",
    "10 min read": "10 dk okuma",
    "Useful React Hooks for 2024": "2024 İçin Yararlı React Hook'ları",
    "A curated list of custom hooks I use in almost every project to speed up development.": "Geliştirmeyi hızlandırmak için neredeyse her projede kullandığım özel hook'ların küratörlüğünü yaptığım bir liste.",
    "Copy Snippets": "Parçacıkları Kopyala",
    "Designing Idempotent APIs": "Idempotent API'ler Tasarlama",
    "Ensure consistency in your distributed systems by handling duplicate requests gracefully.": "Yinelenen istekleri zarif bir şekilde ele alarak dağıtık sistemlerinizde tutarlılığı sağlayın.",
    "Dec 01, 2023": "01 Ara 2023",
    "15 min read": "15 dk okuma",
    "OAuth 2.0 Simplified": "OAuth 2.0 Basitleştirilmiş",
    "Breaking down the authorization flow without the confusing jargon.": "Kafa karıştırıcı jargon olmadan yetkilendirme akışını parçalara ayırmak.",
    "Dec 10, 2023": "10 Ara 2023",
    "7 min read": "7 dk okuma",
    "Stay in the Loop": "Haberdar Kalın",
    "Join 5,000+ developers receiving monthly insights on frontend architecture, system design, and career growth. No spam, just code.": "Ön uç mimarisi, sistem tasarımı ve kariyer gelişimi hakkında aylık içgörüler alan 5.000'den fazla geliştiriciye katılın. İstenmeyen posta yok, sadece kod var.",
    "Subscribe": "Abone Ol",
    "Unsubscribe at any time.": "İstediğiniz zaman abonelikten çıkabilirsiniz.",
    "Building digital products with passion and precision. Based in the Cloud.": "Tutku ve titizlikle dijital ürünler oluşturmak. Bulut tabanlı.",
    "Privacy Policy": "Gizlilik Politikası",
    "Terms of Service": "Hizmet Şartları",
    "Insights": "İçgörüler",
    "Latest Articles": "Son Makaleler",
    "Back to Home": "Ana Sayfaya Dön"
}
